tkh1000/Meshtastic-Meshcore-Dualboot-Heltec-V4-/selector/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Partition table — use our custom CSV
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_dualboot.csv"

# OTA (needed for esp_ota_ops.h)
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n

# NVS
CONFIG_NVS_ENCRYPTION=n

# Reduce binary size (selector must fit in 1MB factory partition)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

# USB serial (ESP32-S3)
CONFIG_ESP_CONSOLE_USB_CDC=y

# Hold PRG (GPIO0) for 3s on any reset to wipe OTA data and return to selector
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=0
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=2
